app/controllers/zologicos_controller.rb

SELECT "zologicos".* FROM "zologicos"
---
  def index
    @zologicos = Zologico.all

INSERT INTO "zologicos" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "changos"], ["created_at", "2016-11-16 01:12:22.062711"], ["updated_at", "2016-11-16 01:12:22.062711"]]
---
  def create
    @zologico = Zologico.new(zologico_params)

    respond_to do |format|
      if @zologico.save

SELECT  "zologicos".* FROM "zologicos" WHERE "zologicos"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_zologico
      @zologico = Zologico.find(params[:id])